# Directcontext3dSourceId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..Directcontext3dSourceId Property
ParameterTypeId Class See Also
---
"Path"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId Directcontext3dSourceId { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Directcontext3dSourceId As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Directcontext3dSourceId {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace